Revit 2027 API
BuiltInFailures.ElectricalFailures.MismatchDistributionSystem Property
 [Name1] and [Name2] cannot connect with each other due to mismatched voltage or number of phases.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MismatchDistributionSystem { get; }
Public Shared ReadOnly Property MismatchDistributionSystem As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MismatchDistributionSystem {
	FailureDefinitionId^ get ();
}
static member MismatchDistributionSystem : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace